task/single-software/cli/openfoam/task-16/init_file/shockTube_base/system/blockMeshDict
FoamFile
{
    format ascii;
    class dictionary;
    object blockMeshDict;
}
convertToMeters 1;
vertices
(
    (0 0 0)
    (1 0 0)
    (1 0.01 0)
    (0 0.01 0)
    (0 0 0.01)
    (1 0 0.01)
    (1 0.01 0.01)
    (0 0.01 0.01)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (1000 1 1) simpleGrading (1 1 1) // TODO_NX
);
boundary
(
    leftRight
    {
        type patch;
        faces
        (
            (0 3 7 4)
            (1 5 6 2)
        );
    }
    empty
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 7 6 5)
            (0 4 5 1)
            (3 2 6 7)
        );
    }
);
